Test showing diagram with mermaid
